MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM362F10FG/mcu.h
#define TSB_SC2_EN_SIOE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->EN,0)))
#define TSB_SC2_MOD0_WU                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD0,4)))
#define TSB_SC2_MOD0_RXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD0,5)))
#define TSB_SC2_MOD0_CTSE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD0,6)))
#define TSB_SC2_MOD0_TB8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD0,7)))
#define TSB_SC2_BRCR_BRADDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->BRCR,6)))
#define TSB_SC2_MOD1_TXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD1,4)))
#define TSB_SC2_MOD1_I2SC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD1,7)))
#define TSB_SC2_MOD2_WBUF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,2)))
#define TSB_SC2_MOD2_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,3)))
#define TSB_SC2_MOD2_SBLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,4)))
#define TSB_SC2_MOD2_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,5)))
#define TSB_SC2_MOD2_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,6)))
#define TSB_SC2_MOD2_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,7)))
#define TSB_SC2_RFC_RFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->RFC,6)))
#define TSB_SC2_RFC_RFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC2->RFC,7)))
#define TSB_SC2_TFC_TFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->TFC,6)))
#define TSB_SC2_TFC_TFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC2->TFC,7)))
#define TSB_SC2_RST_ROR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->RST,7)))
#define TSB_SC2_TST_TUR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->TST,7)))
#define TSB_SC2_FCNF_CNFG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,0)))
#define TSB_SC2_FCNF_RXTXCNT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,1)))
#define TSB_SC2_FCNF_RFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,2)))
#define TSB_SC2_FCNF_TFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,3)))
#define TSB_SC2_FCNF_RFST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,4)))

#define TSB_SC3_EN_SIOE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->EN,0)))
#define TSB_SC3_MOD0_WU                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD0,4)))
#define TSB_SC3_MOD0_RXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD0,5)))
#define TSB_SC3_MOD0_CTSE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD0,6)))
#define TSB_SC3_MOD0_TB8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD0,7)))
#define TSB_SC3_BRCR_BRADDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->BRCR,6)))
#define TSB_SC3_MOD1_TXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD1,4)))
#define TSB_SC3_MOD1_I2SC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD1,7)))
#define TSB_SC3_MOD2_WBUF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD2,2)))
#define TSB_SC3_MOD2_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD2,3)))
#define TSB_SC3_MOD2_SBLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->MOD2,4)))
#define TSB_SC3_MOD2_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC3->MOD2,5)))
#define TSB_SC3_MOD2_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC3->MOD2,6)))
#define TSB_SC3_MOD2_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC3->MOD2,7)))
#define TSB_SC3_RFC_RFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->RFC,6)))
#define TSB_SC3_RFC_RFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC3->RFC,7)))
#define TSB_SC3_TFC_TFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->TFC,6)))
#define TSB_SC3_TFC_TFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC3->TFC,7)))
#define TSB_SC3_RST_ROR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC3->RST,7)))
#define TSB_SC3_TST_TUR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC3->TST,7)))
#define TSB_SC3_FCNF_CNFG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->FCNF,0)))
#define TSB_SC3_FCNF_RXTXCNT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->FCNF,1)))
#define TSB_SC3_FCNF_RFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->FCNF,2)))
#define TSB_SC3_FCNF_TFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->FCNF,3)))
#define TSB_SC3_FCNF_RFST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC3->FCNF,4)))

#define TSB_SC4_EN_SIOE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->EN,0)))
#define TSB_SC4_MOD0_WU                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD0,4)))
#define TSB_SC4_MOD0_RXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD0,5)))
#define TSB_SC4_MOD0_CTSE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD0,6)))
#define TSB_SC4_MOD0_TB8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD0,7)))
#define TSB_SC4_BRCR_BRADDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->BRCR,6)))
#define TSB_SC4_MOD1_TXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD1,4)))
#define TSB_SC4_MOD1_I2SC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD1,7)))
#define TSB_SC4_MOD2_WBUF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD2,2)))
#define TSB_SC4_MOD2_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD2,3)))
#define TSB_SC4_MOD2_SBLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->MOD2,4)))
#define TSB_SC4_MOD2_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC4->MOD2,5)))
#define TSB_SC4_MOD2_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC4->MOD2,6)))
#define TSB_SC4_MOD2_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC4->MOD2,7)))
#define TSB_SC4_RFC_RFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->RFC,6)))
#define TSB_SC4_RFC_RFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC4->RFC,7)))
#define TSB_SC4_TFC_TFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->TFC,6)))
#define TSB_SC4_TFC_TFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC4->TFC,7)))
#define TSB_SC4_RST_ROR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC4->RST,7)))
#define TSB_SC4_TST_TUR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC4->TST,7)))
#define TSB_SC4_FCNF_CNFG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->FCNF,0)))
#define TSB_SC4_FCNF_RXTXCNT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->FCNF,1)))
#define TSB_SC4_FCNF_RFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->FCNF,2)))
#define TSB_SC4_FCNF_TFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->FCNF,3)))
#define TSB_SC4_FCNF_RFST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC4->FCNF,4)))

#define TSB_SC5_EN_SIOE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->EN,0)))
#define TSB_SC5_MOD0_WU                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD0,4)))
#define TSB_SC5_MOD0_RXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD0,5)))
#define TSB_SC5_MOD0_CTSE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD0,6)))
#define TSB_SC5_MOD0_TB8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD0,7)))
#define TSB_SC5_BRCR_BRADDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->BRCR,6)))
#define TSB_SC5_MOD1_TXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD1,4)))
#define TSB_SC5_MOD1_I2SC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD1,7)))
#define TSB_SC5_MOD2_WBUF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD2,2)))
#define TSB_SC5_MOD2_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD2,3)))
#define TSB_SC5_MOD2_SBLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->MOD2,4)))
#define TSB_SC5_MOD2_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC5->MOD2,5)))
#define TSB_SC5_MOD2_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC5->MOD2,6)))
#define TSB_SC5_MOD2_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC5->MOD2,7)))
#define TSB_SC5_RFC_RFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->RFC,6)))
#define TSB_SC5_RFC_RFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC5->RFC,7)))
#define TSB_SC5_TFC_TFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->TFC,6)))
#define TSB_SC5_TFC_TFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC5->TFC,7)))
#define TSB_SC5_RST_ROR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC5->RST,7)))
#define TSB_SC5_TST_TUR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC5->TST,7)))
#define TSB_SC5_FCNF_CNFG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->FCNF,0)))
#define TSB_SC5_FCNF_RXTXCNT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->FCNF,1)))
#define TSB_SC5_FCNF_RFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->FCNF,2)))
#define TSB_SC5_FCNF_TFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->FCNF,3)))
#define TSB_SC5_FCNF_RFST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC5->FCNF,4)))

#define TSB_SC6_EN_SIOE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->EN,0)))
#define TSB_SC6_MOD0_WU                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD0,4)))
#define TSB_SC6_MOD0_RXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD0,5)))
#define TSB_SC6_MOD0_CTSE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD0,6)))
#define TSB_SC6_MOD0_TB8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD0,7)))
#define TSB_SC6_BRCR_BRADDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->BRCR,6)))
#define TSB_SC6_MOD1_TXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD1,4)))
#define TSB_SC6_MOD1_I2SC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD1,7)))
#define TSB_SC6_MOD2_WBUF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD2,2)))
#define TSB_SC6_MOD2_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD2,3)))
#define TSB_SC6_MOD2_SBLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->MOD2,4)))
#define TSB_SC6_MOD2_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC6->MOD2,5)))
#define TSB_SC6_MOD2_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC6->MOD2,6)))
#define TSB_SC6_MOD2_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC6->MOD2,7)))
#define TSB_SC6_RFC_RFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->RFC,6)))
#define TSB_SC6_RFC_RFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC6->RFC,7)))
#define TSB_SC6_TFC_TFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->TFC,6)))
#define TSB_SC6_TFC_TFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC6->TFC,7)))
#define TSB_SC6_RST_ROR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC6->RST,7)))
#define TSB_SC6_TST_TUR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC6->TST,7)))
#define TSB_SC6_FCNF_CNFG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->FCNF,0)))
#define TSB_SC6_FCNF_RXTXCNT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->FCNF,1)))
#define TSB_SC6_FCNF_RFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->FCNF,2)))
#define TSB_SC6_FCNF_TFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->FCNF,3)))
#define TSB_SC6_FCNF_RFST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC6->FCNF,4)))

#define TSB_SC7_EN_SIOE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->EN,0)))
#define TSB_SC7_MOD0_WU                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD0,4)))
#define TSB_SC7_MOD0_RXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD0,5)))
#define TSB_SC7_MOD0_CTSE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD0,6)))
#define TSB_SC7_MOD0_TB8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD0,7)))
#define TSB_SC7_BRCR_BRADDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->BRCR,6)))
#define TSB_SC7_MOD1_TXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD1,4)))
#define TSB_SC7_MOD1_I2SC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD1,7)))
#define TSB_SC7_MOD2_WBUF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD2,2)))
#define TSB_SC7_MOD2_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD2,3)))
#define TSB_SC7_MOD2_SBLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->MOD2,4)))
#define TSB_SC7_MOD2_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC7->MOD2,5)))
#define TSB_SC7_MOD2_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC7->MOD2,6)))
#define TSB_SC7_MOD2_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC7->MOD2,7)))
#define TSB_SC7_RFC_RFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->RFC,6)))
#define TSB_SC7_RFC_RFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC7->RFC,7)))
#define TSB_SC7_TFC_TFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->TFC,6)))
#define TSB_SC7_TFC_TFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC7->TFC,7)))
#define TSB_SC7_RST_ROR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC7->RST,7)))
#define TSB_SC7_TST_TUR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC7->TST,7)))
#define TSB_SC7_FCNF_CNFG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->FCNF,0)))
#define TSB_SC7_FCNF_RXTXCNT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->FCNF,1)))
#define TSB_SC7_FCNF_RFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->FCNF,2)))
#define TSB_SC7_FCNF_TFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->FCNF,3)))
#define TSB_SC7_FCNF_RFST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC7->FCNF,4)))

#define TSB_SC8_EN_SIOE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->EN,0)))
#define TSB_SC8_MOD0_WU                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD0,4)))
#define TSB_SC8_MOD0_RXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD0,5)))
#define TSB_SC8_MOD0_CTSE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD0,6)))
#define TSB_SC8_MOD0_TB8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD0,7)))
#define TSB_SC8_BRCR_BRADDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->BRCR,6)))
#define TSB_SC8_MOD1_TXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD1,4)))
#define TSB_SC8_MOD1_I2SC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD1,7)))
#define TSB_SC8_MOD2_WBUF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,2)))
#define TSB_SC8_MOD2_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,3)))
#define TSB_SC8_MOD2_SBLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,4)))
#define TSB_SC8_MOD2_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,5)))
#define TSB_SC8_MOD2_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,6)))
#define TSB_SC8_MOD2_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,7)))
#define TSB_SC8_RFC_RFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->RFC,6)))
#define TSB_SC8_RFC_RFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC8->RFC,7)))
#define TSB_SC8_TFC_TFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->TFC,6)))
#define TSB_SC8_TFC_TFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC8->TFC,7)))
#define TSB_SC8_RST_ROR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->RST,7)))
#define TSB_SC8_TST_TUR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->TST,7)))
#define TSB_SC8_FCNF_CNFG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,0)))
#define TSB_SC8_FCNF_RXTXCNT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,1)))
#define TSB_SC8_FCNF_RFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,2)))
#define TSB_SC8_FCNF_TFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,3)))
#define TSB_SC8_FCNF_RFST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,4)))

#define TSB_SC9_EN_SIOE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->EN,0)))
#define TSB_SC9_MOD0_WU                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD0,4)))
#define TSB_SC9_MOD0_RXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD0,5)))
#define TSB_SC9_MOD0_CTSE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD0,6)))
#define TSB_SC9_MOD0_TB8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD0,7)))
#define TSB_SC9_BRCR_BRADDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->BRCR,6)))
#define TSB_SC9_MOD1_TXE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD1,4)))
#define TSB_SC9_MOD1_I2SC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD1,7)))
#define TSB_SC9_MOD2_WBUF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,2)))
#define TSB_SC9_MOD2_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,3)))
#define TSB_SC9_MOD2_SBLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,4)))
#define TSB_SC9_MOD2_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,5)))
#define TSB_SC9_MOD2_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,6)))
#define TSB_SC9_MOD2_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,7)))
#define TSB_SC9_RFC_RFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->RFC,6)))
#define TSB_SC9_RFC_RFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC9->RFC,7)))
#define TSB_SC9_TFC_TFIS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->TFC,6)))
#define TSB_SC9_TFC_TFCS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC9->TFC,7)))
#define TSB_SC9_RST_ROR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->RST,7)))
#define TSB_SC9_TST_TUR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->TST,7)))
#define TSB_SC9_FCNF_CNFG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,0)))
#define TSB_SC9_FCNF_RXTXCNT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,1)))
#define TSB_SC9_FCNF_RFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,2)))
#define TSB_SC9_FCNF_TFIE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,3)))
#define TSB_SC9_FCNF_RFST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,4)))

#define TSB_SC10_EN_SIOE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->EN,0)))
#define TSB_SC10_MOD0_WU                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD0,4)))
#define TSB_SC10_MOD0_RXE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD0,5)))
#define TSB_SC10_MOD0_CTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD0,6)))
#define TSB_SC10_MOD0_TB8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD0,7)))
#define TSB_SC10_BRCR_BRADDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->BRCR,6)))
#define TSB_SC10_MOD1_TXE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD1,4)))
#define TSB_SC10_MOD1_I2SC                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD1,7)))
#define TSB_SC10_MOD2_WBUF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,2)))
#define TSB_SC10_MOD2_DRCHG                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,3)))
#define TSB_SC10_MOD2_SBLEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,4)))
#define TSB_SC10_MOD2_TXRUN                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,5)))
#define TSB_SC10_MOD2_RBFLL                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,6)))
#define TSB_SC10_MOD2_TBEMP                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,7)))
#define TSB_SC10_RFC_RFIS                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->RFC,6)))
#define TSB_SC10_RFC_RFCS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC10->RFC,7)))
#define TSB_SC10_TFC_TFIS                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->TFC,6)))
#define TSB_SC10_TFC_TFCS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC10->TFC,7)))
#define TSB_SC10_RST_ROR                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->RST,7)))
#define TSB_SC10_TST_TUR                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->TST,7)))
#define TSB_SC10_FCNF_CNFG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,0)))
#define TSB_SC10_FCNF_RXTXCNT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,1)))
#define TSB_SC10_FCNF_RFIE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,2)))
#define TSB_SC10_FCNF_TFIE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,3)))
#define TSB_SC10_FCNF_RFST                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,4)))

